4439-A1/ELEC327-TicTacToe/i2c_controller_rw_multibyte_fifo_interrupts_LP_MSPM0G3507_nortos_ticlang/Debug/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X
#define CONFIG_MSPM0G3507

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define CPUCLK_FREQ                                                     32000000




/* Defines for I2C1 */
#define I2C1_INST                                                           I2C1
#define I2C1_INST_IRQHandler                                     I2C1_IRQHandler
#define I2C1_INST_INT_IRQN                                         I2C1_INT_IRQn
#define I2C1_BUS_SPEED_HZ                                                 400000
#define GPIO_I2C1_SDA_PORT                                                 GPIOB
#define GPIO_I2C1_SDA_PIN                                          DL_GPIO_PIN_3
#define GPIO_I2C1_IOMUX_SDA                                      (IOMUX_PINCM16)
#define GPIO_I2C1_IOMUX_SDA_FUNC                       IOMUX_PINCM16_PF_I2C1_SDA
#define GPIO_I2C1_SCL_PORT                                                 GPIOB
#define GPIO_I2C1_SCL_PIN                                          DL_GPIO_PIN_2
#define GPIO_I2C1_IOMUX_SCL                                      (IOMUX_PINCM15)
#define GPIO_I2C1_IOMUX_SCL_FUNC                       IOMUX_PINCM15_PF_I2C1_SCL



/* Port definition for Pin Group GPIO_INT */
#define GPIO_INT_PORT                                                    (GPIOA)

/* Defines for INT: GPIOA.28 with pinCMx 3 on package pin 35 */
// pins affected by this interrupt request:["INT"]
#define GPIO_INT_INT_IRQN                                       (GPIOA_INT_IRQn)
#define GPIO_INT_INT_IIDX                       (DL_INTERRUPT_GROUP1_IIDX_GPIOA)
#define GPIO_INT_INT_IIDX                                   (DL_GPIO_IIDX_DIO28)
#define GPIO_INT_INT_PIN                                        (DL_GPIO_PIN_28)
#define GPIO_INT_INT_IOMUX                                        (IOMUX_PINCM3)
/* Port definition for Pin Group MOTOR */
#define MOTOR_PORT                                                       (GPIOA)

/* Defines for MOTOR_PIN: GPIOA.13 with pinCMx 35 on package pin 6 */
#define MOTOR_MOTOR_PIN_PIN                                     (DL_GPIO_PIN_13)
#define MOTOR_MOTOR_PIN_IOMUX                                    (IOMUX_PINCM35)
/* Port definition for Pin Group BUZZER_IO */
#define BUZZER_IO_PORT                                                   (GPIOA)

/* Defines for PIN_0: GPIOA.12 with pinCMx 34 on package pin 5 */
#define BUZZER_IO_PIN_0_PIN                                     (DL_GPIO_PIN_12)
#define BUZZER_IO_PIN_0_IOMUX                                    (IOMUX_PINCM34)
/* Port definition for Pin Group GPIO_LEDS */
#define GPIO_LEDS_PORT                                                   (GPIOA)

/* Defines for USER_LED_1: GPIOA.0 with pinCMx 1 on package pin 33 */
#define GPIO_LEDS_USER_LED_1_PIN                                 (DL_GPIO_PIN_0)
#define GPIO_LEDS_USER_LED_1_IOMUX                                (IOMUX_PINCM1)
/* Defines for USER_TEST: GPIOA.15 with pinCMx 37 on package pin 8 */
#define GPIO_LEDS_USER_TEST_PIN                                 (DL_GPIO_PIN_15)
#define GPIO_LEDS_USER_TEST_IOMUX                                (IOMUX_PINCM37)

/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_I2C1_init(void);



#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
